import 'models/zekr.dart';
import 'models/categories.dart';

List<Category> categoriesData = [
  Category(
    id: 'c1',
    title: 'اذكار الصباح',
  ),
  Category(
    id: 'c2',
    title: 'اذكار المساء',
  ),
  Category(
    id: 'c4',
    title: 'اذكار النوم',
  ),
  Category(
    id: 'c3',
    title: 'اذكار بعد الصلاة',
  ),
  Category(
    id: 'c5',
    title: 'اذكار الاستيقاظ',
  ),
  Category(
    id: 'c6',
    title: 'ادعية نبوية',
  ),
  Category(
    id: 'c8',
    title: 'الادعية القرانية',
  ),
  Category(
    id: 'c7',
    title: 'اذكار الاذان',
  ),
  Category(
    id: 'c9',
    title: 'اذكار المسجد',
  ),
  Category(
    id: 'c10',
    title: 'اذكار الوضوء',
  ),
  Category(
    id: 'c11',
    title: 'اذكار المنزل',
  ),
  Category(
    id: 'c12',
    title: 'اذكار الخلاء',
  ),
  Category(
    id: 'c13',
    title: 'اذكار الطعام',
  ),
  Category(
    id: 'c14',
    title: 'ادعيه للميت',
  ),
  Category(
    id: 'c15',
    title: 'دعاء لبس الثوب',
  ),
  Category(
    id: 'c16',
    title: 'دعاء لبس الثوب الجديد',
  ),
  Category(
    id: 'c17',
    title: 'دعاء الكرب',
  ),
  Category(
    id: 'c18',
    title: 'دعاء الهم والحزن',
  ),
  Category(
    id: 'c19',
    title: 'دعاء قضاء الدين',
  ),
  Category(
    id: 'c20',
    title: 'دعاء الريح',
  ),
  Category(
    id: 'c21',
    title: 'دعاء الرعـد',
  ),
  Category(
    id: 'c22',
    title: 'دعاء زيارة القبور',
  ),
  Category(
    id: 'c23',
    title: 'دعاء نزول المطر',
  ),
  Category(
    id: 'c24',
    title: 'دعاء السفر',
  ),
  Category(
    id: 'c25',
    title: 'دعـاء من استصعب عليه أمر',
  ),
  Category(
    id: 'c26',
    title: 'دعـاء الخوف من الشــرك',
  ),
  Category(
    id: 'c27',
    title: 'دعاء من رأى مبتلى',
  ),
  Category(
    id: 'c28',
    title: 'دعـاء الغـضـب',
  ),
  Category(
    id: 'c29',
    title: 'الدعاء للمتزوج',
  ),
  Category(
    id: 'c30',
    title: 'دعاء المتزوج لنفسه',
  ),
  Category(
    id: 'c31',
    title: 'الدعاء قبل الجماع',
  ),
  Category(
    id: 'c32',
    title: 'دعاء العطاس',
  ),
  Category(
    id: 'c33',
    title: 'الدعاء عند افطار الصائم',
  ),
  Category(
    id: 'c34',
    title: 'دعاء من أصيب بمصيبة',
  ),
  Category(
    id: 'c35',
    title: 'الدعاء للمريض في عيادته',
  ),
  Category(
    id: 'c36',
    title: 'دعـاء صـلاة الاستخـارة',
  ),
  Category(
    id: 'c37',
    title: 'دعـاء الاستفتاح',
  ),
  Category(
    id: 'c38',
    title: 'عند فعل الذنب أو ارتكاب المعصية',
  ),
  Category(
    id: 'c39',
    title: 'سيد الاستغفار',
  ),
  Category(
    id: 'c40',
    title: 'فضائل القرآن',
  ),

  //   Categories(
  //   id: '',
  //   title:'',
  // ),
];

List<Zekr> azkarData = [
  Zekr(
    numberInCircule: 1,
    id: 'z1',
    number: 'مره',
    categories: [
      'c1',
      'c2',
      'c3',
    ],
    description:
        'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ \n { اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. }',
  ),
  Zekr(
    numberInCircule: 1,
    id: 'z1',
    number: 'مره',
    categories: [
      'c2',
    ],
    description:
        'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ \n { آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ } ',
  ),
  Zekr(
    numberInCircule: 3,
    id: 'z2',
    number: 'ثلاث مرات',
    categories: [
      'c1',
      'c2',
    ],
    description:
        'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم \n { قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ. }',
  ),
  Zekr(
    numberInCircule: 3,
    id: 'z3',
    number: 'ثلاث مرات',
    categories: [
      'c1',
      'c2',
    ],
    description:
        'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم \n { قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.  }',
  ),
  Zekr(
    numberInCircule: 3,
    id: 'z4',
    number: 'ثلاث مرات',
    categories: [
      'c1',
      'c2',
    ],
    description:
        'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم \n { قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ. }',
  ),
  Zekr(
    numberInCircule: 1,
    id: 'z5',
    number: 'مره',
    categories: [
      'c1',
    ],
    description:
        'أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.',
  ),
  Zekr(
    numberInCircule: 1,
    id: 'z5',
    number: 'مره',
    categories: [
      'c2',
    ],
    description:
        'أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر. ',
  ),
  Zekr(
    numberInCircule: 1,
    id: 'z6',
    number: 'مره',
    categories: [
      'c1',
      'c2',
    ],
    description:
        'اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .',
  ),
  Zekr(
    numberInCircule: 3,
    id: 'z7',
    number: 'ثلاث مرات',
    categories: [
      'c1',
      'c2',
    ],
    description:
        'رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.',
  ),
  Zekr(
    numberInCircule: 4,
    id: 'z7',
    number: 'أربع مرات',
    categories: [
      'c2',
    ],
    description:
        'اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.',
  ),
  Zekr(
    numberInCircule: 1,
    id: 'z7',
    number: 'مره',
    categories: [
      'c2',
    ],
    description:
        'اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.',
  ),
  Zekr(
    numberInCircule: 4,
    id: 'z8',
    number: 'أربع مرات',
    categories: [
      'c1',
    ],
    description:
        'اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.',
  ),
  Zekr(
    numberInCircule: 1,
    id: 'z9',
    number: 'مره',
    categories: [
      'c1',
    ],
    description:
        'اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر. ',
  ),
  Zekr(
    numberInCircule: 7,
    id: 'z10',
    number: 'سبع مرات',
    categories: [
      'c1',
      'c2',
    ],
    description:
        'حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.',
  ),
  Zekr(
    numberInCircule: 3,
    id: 'z11',
    number: 'ثلاث مرات',
    categories: [
      'c1',
      'c2',
    ],
    description:
        'بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.',
  ),
  Zekr(
    numberInCircule: 1,
    id: 'bz13',
    number: 'مره',
    categories: [
      'c2',
    ],
    description:
        'اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ.',
  ),
  Zekr(
    numberInCircule: 1,
    id: 'bz14',
    number: 'مره',
    categories: [
      'c2',
    ],
    description:
        'أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ. ',
  ),
  Zekr(
    numberInCircule: 1,
    id: 'z12',
    number: 'مره',
    categories: [
      'c1',
    ],
    description:
        'اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.',
  ),
  Zekr(
    numberInCircule: 1,
    id: 'z13',
    number: 'مره',
    categories: [
      'c1',
    ],
    description:
        'أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.',
  ),
  Zekr(
    numberInCircule: 3,
    id: 'z14',
    number: 'ثلاث مرات',
    categories: [
      'c1',
      'c2',
    ],
    description:
        'سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.',
  ),
  Zekr(
    numberInCircule: 3,
    id: 'z15',
    number: 'ثلاث مرات',
    categories: [
      'c1',
      'c2',
    ],
    description:
        'اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.',
  ),
  Zekr(
    numberInCircule: 3,
    id: 'z16',
    number: 'ثلاث مرات',
    categories: [
      'c1',
      'c2',
    ],
    description:
        'اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.',
  ),
  Zekr(
    numberInCircule: 1,
    id: 'z17',
    number: 'مره',
    categories: [
      'c1',
      'c2',
    ],
    description:
        'اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.',
  ),
  Zekr(
    numberInCircule: 3,
    id: 'z18',
    number: 'ثلاث مرات',
    categories: [
      'c1',
      'c2',
    ],
    description:
        'يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.',
  ),
  Zekr(
    numberInCircule: 1,
    id: 'z19',
    number: 'مره',
    categories: [
      'c1',
    ],
    description:
        'أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه.',
  ),
  Zekr(
    numberInCircule: 1,
    id: 'bz20',
    number: 'مره',
    categories: [
      'c2',
    ],
    description:
        'أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا. ',
  ),
  Zekr(
    numberInCircule: 1,
    id: 'z20',
    number: 'مره',
    categories: [
      'c1',
      'c2',
    ],
    description:
        'اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.',
  ),
  Zekr(
    numberInCircule: 3,
    id: 'z21',
    number: 'ثلاث مرات',
    categories: [
      'c1',
      'c2',
    ],
    description:
        'أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.',
  ),
  Zekr(
    numberInCircule: 10,
    id: 'z22',
    number: 'عشر مرات',
    categories: [
      'c1',
      'c2',
    ],
    description:
        'اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد. ',
  ),
  Zekr(
    numberInCircule: 3,
    id: 'z23',
    number: 'ثلاث مرات',
    categories: [
      'c1',
      'c2',
    ],
    description:
        'اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ. ',
  ),
  Zekr(
    numberInCircule: 3,
    id: 'z24',
    number: 'ثلاث مرات',
    categories: [
      'c1',
      'c2',
    ],
    description:
        'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.',
  ),
  Zekr(
    numberInCircule: 3,
    id: 'z25',
    number: 'ثلاث مرات',
    categories: [
      'c1',
      'c2',
    ],
    description:
        'أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.',
  ),
  Zekr(
    numberInCircule: 3,
    id: 'z26',
    number: 'ثلاث مرات',
    categories: [
      'c1',
      'c2',
    ],
    description:
        'يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ.',
  ),
  Zekr(
    numberInCircule: 1,
    id: 'z27',
    number: 'مره',
    categories: [
      'c1',
    ],
    description:
        'اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا. ',
  ),
  Zekr(
    numberInCircule: 1,
    id: 'z28',
    number: 'مره',
    categories: [
      'c1',
      'c2',
    ],
    description:
        'اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ. ',
  ),
  Zekr(
    numberInCircule: 100,
    id: 'z29',
    number: 'مائه مره',
    categories: [
      'c1',
      'c2',
    ],
    description:
        'لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.',
  ),
  Zekr(
    numberInCircule: 100,
    id: 'z30',
    number: 'مائه مره',
    categories: [
      'c1',
      'c2',
    ],
    description: 'سُبْحـانَ اللهِ وَبِحَمْـدِهِ. ',
  ),
  Zekr(
    numberInCircule: 100,
    id: 'z31',
    number: 'مائه مره',
    categories: [
      'c1',
    ],
    description: 'أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ ',
  ),
  Zekr(
    categories: ['c3'],
    id: 'z',
    number: 'مره',
    description:
        'أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله.\nاللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام . ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c3'],
    id: 'z',
    number: 'مره',
    description:
        'لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْد، وهوَ على كلّ شَيءٍ قَدير، اللّهُـمَّ لا مانِعَ لِما أَعْطَـيْت، وَلا مُعْطِـيَ لِما مَنَـعْت، وَلا يَنْفَـعُ ذا الجَـدِّ مِنْـكَ الجَـد. ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c3'],
    id: 'z',
    number: 'مره',
    description:
        'لا إلهَ إلاّ اللّه, وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمد، وهوَ على كلّ شيءٍ قدير، لا حَـوْلَ وَلا قـوَّةَ إِلاّ بِاللهِ، لا إلهَ إلاّ اللّـه، وَلا نَعْـبُـدُ إِلاّ إيّـاه, لَهُ النِّعْـمَةُ وَلَهُ الفَضْل وَلَهُ الثَّـناءُ الحَـسَن، لا إلهَ إلاّ اللّهُ مخْلِصـينَ لَـهُ الدِّينَ وَلَوْ كَـرِهَ الكـافِرون. ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c3'],
    id: 'z',
    number: '33 مره',
    description: 'سُـبْحانَ اللهِ',
    numberInCircule: 33,
  ),
  Zekr(
    categories: ['c3'],
    id: 'z',
    number: '33 مره',
    description: 'الحَمْـدُ لله',
    numberInCircule: 33,
  ),
  Zekr(
    categories: ['c3'],
    id: 'z',
    number: '33 مره',
    description: 'اللهُ أكْـبَر',
    numberInCircule: 33,
  ),
  Zekr(
    categories: ['c3'],
    id: 'z',
    number: 'مره',
    description:
        'لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَـدير.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c3'],
    id: 'z',
    number: '3 مرات',
    description:
        'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم \n قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ. \n\n\n\n\n\n ثلاث مرات بعد صلاتي الفجر والمغرب. ومرة بعد الصلوات الأخرى.',
    numberInCircule: 3,
  ),
  Zekr(
    categories: ['c3'],
    id: 'z',
    number: '3 مره',
    description:
        'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم \n قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ. \n\n\n\n\n\n ثلاث مرات بعد صلاتي الفجر والمغرب. ومرة بعد الصلوات الأخرى.',
    numberInCircule: 3,
  ),
  Zekr(
    categories: ['c3'],
    id: 'z',
    number: '3 مره',
    description:
        'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم \n قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ. \n\n\n\n\n\n ثلاث مرات بعد صلاتي الفجر والمغرب. ومرة بعد الصلوات الأخرى.',
    numberInCircule: 3,
  ),
  Zekr(
    categories: ['c3'],
    id: 'z',
    number: 'عشر مرات',
    description:
        'لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير. \n\n\n\n\n\n عشر مرات بعد المغرب و الصبح',
    numberInCircule: 10,
  ),
  Zekr(
    categories: ['c3'],
    id: 'z',
    number: 'مره',
    description:
        'اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِلْمـاً نافِعـاً وَرِزْقـاً طَيِّـباً ، وَعَمَـلاً مُتَقَـبَّلاً. \n\n\n\n\n\n بعد السلام من صلاه الفجر',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c3'],
    id: 'z',
    number: 'سبع مرات',
    description:
        'اللَّهُمَّ أَجِرْنِي مِنْ النَّار. \n\n\n\n\n\n بعد صلاه الصبح والمغرب',
    numberInCircule: 7,
  ),
  Zekr(
    categories: ['c3'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ. ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c4'],
    id: 'z',
    number: 'مره',
    description:
        'بِاسْمِكَ رَبِّـي وَضَعْـتُ جَنْـبي ، وَبِكَ أَرْفَعُـه، فَإِن أَمْسَـكْتَ نَفْسـي فارْحَـمْها ، وَإِنْ أَرْسَلْتَـها فاحْفَظْـها بِمـا تَحْفَـظُ بِه عِبـادَكَ الصّـالِحـين.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c4'],
    id: 'z',
    number: 'مره',
    description:
        'اللّهُـمَّ إِنَّـكَ خَلَـقْتَ نَفْسـي وَأَنْـتَ تَوَفّـاهـا لَكَ ممَـاتـها وَمَحْـياها ، إِنْ أَحْيَيْـتَها فاحْفَظْـها ، وَإِنْ أَمَتَّـها فَاغْفِـرْ لَـها . اللّهُـمَّ إِنَّـي أَسْـأَلُـكَ العـافِـيَة.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c4'],
    id: 'z',
    number: 'ثلاث مرات',
    description: 'اللّهُـمَّ قِنـي عَذابَـكَ يَـوْمَ تَبْـعَثُ عِبـادَك.',
    numberInCircule: 3,
  ),
  Zekr(
    categories: ['c4'],
    id: 'z',
    number: 'مره',
    description: 'بِاسْـمِكَ اللّهُـمَّ أَمـوتُ وَأَحْـيا.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c4'],
    id: 'z',
    number: 'مره',
    description:
        'الـحَمْدُ للهِ الَّذي أَطْـعَمَنا وَسَقـانا، وَكَفـانا، وَآوانا، فَكَـمْ مِمَّـنْ لا كـافِيَ لَـهُ وَلا مُـؤْوي.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c4'],
    id: 'z',
    number: 'مره',
    description:
        'اللّهُـمَّ عالِـمَ الغَـيبِ وَالشّـهادةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كُـلِّ شَـيءٍ وَمَليـكَه، أَشْهـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي، وَمِن شَـرِّ الشَّيْـطانِ وَشِـرْكِه، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم . ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c4'],
    id: 'z',
    number: 'مره',
    description:
        'اللّهُـمَّ أَسْـلَمْتُ نَفْـسي إِلَـيْكَ، وَفَوَّضْـتُ أَمْـري إِلَـيْكَ، وَوَجَّـهْتُ وَجْـهي إِلَـيْكَ، وَأَلْـجَـاْتُ ظَهـري إِلَـيْكَ، رَغْبَـةً وَرَهْـبَةً إِلَـيْكَ، لا مَلْجَـأَ وَلا مَنْـجـا مِنْـكَ إِلاّ إِلَـيْكَ، آمَنْـتُ بِكِتـابِكَ الّـذي أَنْزَلْـتَ وَبِنَبِـيِّـكَ الّـذي أَرْسَلْـت. ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c4'],
    id: 'z',
    number: '33 مره',
    description: 'سُبْحَانَ اللَّهِ.',
    numberInCircule: 33,
  ),
  Zekr(
    categories: ['c4'],
    id: 'z',
    number: '33 مره',
    description: 'الْحَمْدُ لِلَّهِ.',
    numberInCircule: 33,
  ),
  Zekr(
    categories: ['c4'],
    id: 'z',
    number: '33 مره',
    description: 'اللَّهُ أَكْبَرُ.',
    numberInCircule: 33,
  ),
  Zekr(
    categories: ['c4'],
    id: 'z',
    number: 'ثلاث مرات',
    description:
        'يجمع كفيه ثم ينفث فيهما والقراءة فيهما‏:‏ ‏{‏قل هو الله أحد‏}‏ و‏{‏قل أعوذ برب الفلق‏}‏ و‏{‏قل أعوذ برب الناس‏}‏ ومسح ما استطاع من الجسد يبدأ بهما على رأسه ووجه وما أقبل من جسده.',
    numberInCircule: 3,
  ),
  Zekr(
    categories: ['c4'],
    id: 'z',
    number: 'مره',
    description:
        'سورة البقرة: أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\nآمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c4'],
    id: 'z',
    number: 'مره',
    description:
        'آية الكرسى: أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\nاللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c4'],
    id: 'z',
    number: 'مره',
    description:
        'أذكار من قلق في فراشه ولم ينم\nعن بريدة رضي الله عنه، قال‏:‏ شكا خالد بن الوليد رضي الله عنه إلى النبي صلى الله عليه وسلم فقال‏:‏ يا رسول الله‏!‏ ما أنام الليل من الأرق، فقال النبي صلى الله عليه وسلم‏:‏ ‏"‏إذا أويت إلى فراشك فقل‏:‏ اللهم رب السموات السبع وما أظلت، ورب الأرضين وما أقلت، ورب الشياطين وما أضلت، كن لي جارا من خلقك كلهم جميعا أن يفرط علي أحد منهم أو أن يبغي علي، عز جارك، وجل ثناؤك ولا إله غيرك، ولا إله إلا أنت‏"',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c4'],
    id: 'z',
    number: 'مره',
    description:
        'أذكار الأحلام\nعن أبي قتادة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏"‏الرؤيا الصالحة‏"‏ وفي رواية ‏"‏الرؤيا الحسنة من الله، والحلم من الشيطان، فمن رأى شيئا يكرهه فلينفث عن شماله ثلاثا وليتعوذ من الشيطان، فإنها لا تضره‏".',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c5'],
    id: 'z',
    number: 'مره',
    description:
        'الحَمْـدُ لِلّهِ الّذي أَحْـيانا بَعْـدَ ما أَماتَـنا وَإليه النُّـشور. ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c5'],
    id: 'z',
    number: 'مره',
    description:
        'الحمدُ للهِ الذي عافاني في جَسَدي وَرَدّ عَليّ روحي وَأَذِنَ لي بِذِكْرِه. ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c5'],
    id: 'z',
    number: 'مره',
    description:
        'لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شَـريكَ له، لهُ المُلـكُ ولهُ الحَمـد، وهوَ على كلّ شيءٍ قدير، سُـبْحانَ اللهِ، والحمْـدُ لله ، ولا إلهَ إلاّ اللهُ واللهُ أكبَر، وَلا حَولَ وَلا قوّة إلاّ باللّهِ العليّ العظيم. رَبِّ اغْفرْ لي.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ أنَْتَ رَبيِّ لَا إلِهََ إلَِّا أنَتَ، خَلَقْتنَيِ وَأنََا عَبدُْكَ، وَأنََا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي إِنَّك أَنْتَ الْغَفُورُ الرَّحِيمُ. ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'رَبِّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي وَإِسْرَافِي فِي أَمْرِي كُلِّهِ وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، اللَّهُمَّ اغْفِرْ لِي خَطَايَايَ وَعَمْدِي وَجَهْلِي وَهَزْلِي، وَكُلُّ ذَلِكَ عِنْدِي، اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ، دِقَّهُ، وَجِلَّهُ، وَأَوَّلَهُ، وَآخِرَهُ، وَعَلَانِيَتَهُ، وَسِرَّهُ.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ وَالْعَجْزِ وَالْكَسَلِ وَالْجُبْنِ وَالْبُخْلِ وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إنِِّي أَعُوذُ بكَِ مِنَ الْبُخْلِ، وَأَعُوذُ بكَِ مِنَ الْجُبْنِ، وَأَعُوذُ بكَِ أَنْ أُرَدَّ إلَِى أَرْذَلِ الْعُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ. ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْهَرَمِ وَالْمَأْثَمِ وَالْمَغْرَمِ، وَمِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ الْقَبْرِ، وَمِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ، وَمِنْ شَرِّ فِتْنَةِ الْغِنَى، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْفَقْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، اللَّهُمَّ اغْسِلْ عَنِّي خَطَايَايَ بِمَاءِ الثَّلْجِ وَالْبَرَدِ، وَنَقِّ قَلْبِي مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنَ الدَّنَسِ، وَبَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ رَبَّ السَّمَوَاتِ وَرَبَّ الْأَرْضِ وَرَبَّ الْعَرْشِ الْعَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ وَالْفُرْقَانِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتهِِ، اللَّهُمَّ أَنْتَ الْأوََّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الْآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي وَاجْعَلِ الْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ، وَاجْعَلِ الْمَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَالْجُبْنِ وَالْبُخْلِ، وَالْهَرَمِ وَعَذَابِ الْقَبْرِ، اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلَاهَا، اللَّهُمَّ إنِِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ، وَمِنْ قَلْبٍ لَا يَخْشَعُ، وَمِنْ نَفْسٍ لَا تَشْبَعُ، وَمِنْ دَعْوَةٍ لَا يُسْتَجَابُ لَهَا',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ لَكَ أَسْلَمْتُ وَبِكَ آمَنْتُ، وَعَلَيْكَ تَوَكَّلْتُ وَإِلَيْكَ أَنَبْتُ وَبِكَ خَاصَمْتُ، اللَّهُمَّ إِنِّي أَعُوذُ بِعِزَّتِكَ لَا إِلَهَ إِلَّا أَنْتَ أَنْ تُضِلَّنيِ، أَنْتَ الْحَيُّ الَّذِي لَا يَمُوتُ وَالْجِنُّ وَالْإِنْسُ يَمُوتُونَ. ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ وَتَحَوُّلِ عَافِيَتِكَ وَفُجَاءَةِ نِقْمَتِكَ وَجَمِيعِ سَخَطِكَ. ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ مُصَرِّفَ الْقُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ. ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ رَبَّ جَبْرَائِيلَ وَمِيكَائِيلَ وَإِسْرَافِيلَ، فَاطِرَ السَّمَوَاتِ وَالأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ، اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ بِإِذْنِكَ، إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوذُ بِكَ مِنْكَ، لَا أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ جَهْدِ الْبَلَاءِ وَدَرَكِ الشَّقَاءِ وَسُوءِ الْقَضَاءِ وَشَمَاتَةِ الْأَعْدَاءِ.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ اجْعَلْ لِي فِي قَلْبِي نُورًا، وَفِي لِسَانِي نُورًا، وَفِي سَمْعِي نُورًا، وَفِي بَصَرِي نُورًا، وَمِنْ فَوْقِي نُورًا، وَمِنْ تَحْتِي نُورًا، وَعَنْ يَمِينِي نُورًا، وَعَنْ شِمَالِي نُورًا، وَمِنْ بَيْنِ يَدَيَّ نُورًا، وَمِنْ خَلْفِي نُورًا، وَاجْعَلْ فِي نَفْسِي نُورًا، وَأَعْظِمْ لِي نُورًا.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَم،ْ وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ بِهِ عَبْدُكَ وَنَبِيُّكَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِي خَيْرًا.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ بِعِلْمِكَ الْغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلْقِ أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْرًا لِي، وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْرًا لِي، اللَّهُمَّ وَأَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأَسْأَلُكَ الْقَصْدَ فِي الْفَقْرِ وَالْغِنَى، وَأَسْأَلُكَ نَعِيمًا لَا يَنْفَدُ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لَا تَنْقَطِعُ، وَأَسْأَلُكَ الرِّضَاءَ بَعْدَ الْقَضَاءِ، وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ وَالشَّوْقَ إِلَى لِقَائِكَ فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ وَلَا فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيِّنَّا بِزِينَةِ الْإِيمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إِنِّي أَسْأَلُكَ العَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي، وَاحْفَظنْيِ مِنْ بيَنِْ يَدَيَّ وَمِنْ خَلْفِي وَعَنْ يَمِينيِ وَعَنْ شِمَاليِ وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي. ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إِنِّي أَسْأَلُكَ الثَّبَاتَ فِي الأَمْرِ، وَالْعَزِيمَةَ عَلَى الرُّشْدِ، وَأَسْأَلُكَ مُوجِبَاتِ رَحْمَتكَِ، وَعَزَائمَِ مَغْفِرَتكَِ، وَأسَْألَكَُ شُكْرَ نعِْمَتكَِ، وَحُسْنَ عِباَدَتكَِ، وَأسَْألَكَُ قَلْبًا سَلِيمًا، وَلِسَانًا صَادِقًا، وَأَسْأَلُكَ مِنْ خَيْرِ مَا تَعْلَمُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا تَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا تَعْلَمُ، إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إلَِهَ إلَِّا أَنْتَ، اللَّهُمَّ إنِِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اللَّهُمَّ إنِِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ. ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'رَبِّ أَعِنِّي وَلَا تُعِنْ عَلَيَّ، وَانْصُرْنِي وَلَا تَنْصُرْ عَلَيَّ، وَامْكُرْ لِي وَل َاتَمْكُرْ عَلَيَّ، وَاهْدِنِي وَيَسِّرِ الْهُدَى لِي، وَانْصُرْنِي عَلَى مَنْ بَغَى عَلَيَّ، رَبِّ اجْعَلْنِي لَكَ شَكَّارًا، لَكَ ذَكَّارًا، لَكَ رَهَّابًا، لَكَ مِطْوَاعًا، لَكَ مُخْبِتًا إِلَيْكَ أَوَّاهًا مُنِيبًا، رَبِّ تَقَبَّلْ تَوْبَتِي وَاغْسِلْ حَوْبَتِي وَأَجِبْ دَعْوَتِي وَثَبِّتْ حُجَّتِي وَسَدِّدْ لِسَانِي وَاهْدِ قَلْبِي وَاسْلُلْ سَخِيمَةَ صَدْرِي.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ لَكَ الْحَمْدُ كُلُّهُ، اللَّهُمَّ لَا قَابِضَ لِمَا بَسَطْتَ، وَلَا بَاسِطَ لِمَا قَبَضْتَ، وَلَا هَادِيَ لِمَا أَضْلَلْت، وَلَا مُضِلَّ لِمَنْ هَدَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا مَانِعَ لِمَا أَعْطَيْتَ، وَلَا مُقَرِّبَ لِمَا بَاعَدْتَ، وَلَا مُبَاعِدَ لِمَا قَرَّبْتَ، اللَّهُمَّ ابْسُطْ عَلَيْنَا مِنْ بَرَكَاتِكَ وَرَحْمَتِكَ وَفَضْلِكَ وَرِزْقِكَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ الْمُقِيمَ الَّذِي لَا يَحُولُ وَلَا يَزُولُ، اللَّهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ يَوْمَ الْعَيْلَةِ، وَالْأَمْنَ يَوْمَ الْخَوْفِ، اللَّهُمَّ إنِِّي عَائذٌِ بكَِ مِنْ شَرِّ مَا أَعْطَيْتَنَا وَشَرِّ مَا مَنَعْتَ، اللَّهُمَّ حَبِّبْ إلَِيْنَا الْإِيمَانَ وَزَيِّنْهُ فيِ قُلُوبِنَا، وَكَرِّهْ إِلَيْنَا الْكُفْرَ وَالْفُسُوقَ وَالْعِصْيَانَ، وَاجْعَلْنَا مِنَ الرَّاشِدِينَ، اللَّهُمَّ تَوَفَّنَا مُسْلِمِينَ، وَأَحْيِنَا مُسْلِمِينَ، وَأَلْحِقْنَا بِالصَّالِحِينَ غَيْرَ خَزَايَا وَلَا مَفْتُونِينَ، اللَّهُمَّ قَاتِلْ الْكَفَرَةَ الَّذِينَ يُكَذِّبُونَ رُسُلَكَ، وَيَصُدُّونَ عَنْ سَبِيلِكَ، وَاجْعَلْ عَلَيْهِمْ رِجْزَكَ وَعَذَابَكَ، اللَّهُمَّ قَاتِلْ الْكَفَرَةَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَهَ الْحَقِّ.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c6'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللّٰهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c7'],
    id: 'z',
    number: 'مره',
    description:
        'ما يقال عند سماع الأذان\nيَقُولُ مِثْلَ مَا يَقُولُ الـمُؤَذِّنُ إلاَّ فِي "حَيَّ عَلَى الصَّلاةِ وَحَيَّ عَلَى الفَلاَحِ" فَيَقُولُ: "لاَ حَوْلَ وَلا قُوَّةَ إلاَّ باللَّهِ".',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c7'],
    id: 'z',
    number: 'مره',
    description:
        'عنْ سَعْدِ بْن أَبي وقَّاصٍ رضِيَ اللَّه عنْهُ عَن النبي صَلّى اللهُ عَلَيْهِ وسَلَّم أَنَّهُ قَالَ: "مَنْ قَال حِينَ يسْمعُ المُؤذِّنَ : أَشْهَد أَنْ لا إِله إِلاَّ اللَّه وحْدهُ لا شَريك لهُ ، وَأَنَّ مُحمَّداً عبْدُهُ وَرسُولُهُ ، رضِيتُ بِاللَّهِ ربًّا ، وبمُحَمَّدٍ رَسُولاً ، وبالإِسْلامِ دِينًا ، غُفِر لَهُ ذَنْبُهُ".',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c7'],
    id: 'z',
    number: 'مره',
    description:
        'عَنْ عبْدِ اللَّهِ بْنِ عَمرِو بْنِ العاصِ رضِيَ اللَّه عنْهُما أَنه سَمِع رسُولَ اللَّهِ صَلّى اللهُ عَلَيْهِ وسَلَّم يقُولُ : "إِذا سمِعْتُمُ النِّداءَ فَقُولُوا مِثْلَ ما يَقُولُ ، ثُمَّ صَلُّوا علَيَّ ، فَإِنَّهُ مَنْ صَلَّى علَيَّ صَلاةً صَلَّى اللَّه عَلَيْهِ بِهَا عشْراً ، ثُمَّ سلُوا اللَّه لي الْوسِيلَةَ ، فَإِنَّهَا مَنزِلَةٌ في الجنَّةِ لا تَنْبَغِي إِلاَّ لعَبْدٍ منْ عِباد اللَّه وَأَرْجُو أَنْ أَكُونَ أَنَا هُو ، فَمنْ سَأَل ليَ الْوسِيلَة حَلَّتْ لَهُ الشَّفاعَةُ"',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c7'],
    id: 'z',
    number: 'مره',
    description:
        'عَنْ جابرٍ بن عبد الله رضَي اللَّه عنهما‏ أَنَّ رَسُولَ اللَّهِ صَلّى اللهُ عَلَيْهِ وسَلَّم قَالَ : "من قَال حِين يسْمعُ النِّداءَ : اللَّهُمَّ رَبَّ هذِهِ الدَّعوةِ التَّامَّةِ ، والصَّلاةِ الْقَائِمةِ، آت مُحَمَّداً الْوسِيلَةَ ، والْفَضَيِلَة، وابْعثْهُ مقَامًا محْمُوداً الَّذي وعَدْتَه ، حلَّتْ لَهُ شَفَاعتي يوْم الْقِيامِة" .',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c7'],
    id: 'z',
    number: 'مره',
    description:
        'ما يقال بعد سماع الأذان\nاللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَى سَيِّدِنَا مُحَمَّدٍ.\nاللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، والصَّلاةِ القَائِمَةِ، آتِ مُـحَمَّداً الوَسِيْلَةَ والفَضِيْلَةَ، وابْعَثْهُ مَقَاماً مَـحْمُوداً الَّذِي وَعَدْتَهُ، إنَّكَ لا تُخْلِفُ الـمِيْعَادِ.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c7'],
    id: 'z',
    number: 'مره',
    description:
        'ما يقال بين الأذان والإقامة\nما بين الأذان والإقامة فالدعاء عندئذٍ مرغّب فيه ومستحب\nقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: "الدُّعَاءُ لَا يُرَدُّ بَيْنَ الْأَذَانِ وَالْإِقَامَةِ".\nقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: "إِنَّ الدُّعَاءَ لَا يُرَدُّ بَيْنَ الْأَذَانِ وَالْإِقَامَةِ فَادْعُوا".',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ".\n [البقرة - 201].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ".\n [البقرة - 250].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ".\n [البقرة - 286].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"رَبَّنَا لاَ تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً إِنَّكَ أَنتَ الْوَهَّابُ".\n [آل عمران - 8]',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ".\n [آل عمران - 16].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"رَبِّ هَبْ لِي مِن لَّدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاء".\n [آل عمران - 38].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"رَبَّنَا آمَنَّا بِمَا أَنزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ".\n [آل عمران - 53].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"ربَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَِ".\n[آل عمران - 147].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"رَبَّنَا مَا خَلَقْتَ هَذا بَاطِلاً سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلإِيمَانِ أَنْ آمِنُواْ بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأبْرَارِ رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَى رُسُلِكَ وَلاَ تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لاَ تُخْلِفُ الْمِيعَادَ".\n [آل عمران - 191-194].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ". \n[الأعراف - 23].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"رَبَّنَا لاَ تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ".\n [الأعراف - 47].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ".\n[الأعراف - 126].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"حَسْبِيَ اللّهُ لا إِلَـهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ".\n[التوبة - 129].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"رَبَّنَا لاَ تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظَّالِمِينَ وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ".\n[يونس - 85-86].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ وَإِلاَّ تَغْفِرْ لِي وَتَرْحَمْنِي أَكُن مِّنَ الْخَاسِرِينَ".\n[هود - 47].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"رَبِّ اجْعَلْنِي مُقِيمَ الصَّلاَةِ وَمِن ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاء".\n [إبرهيم - 40].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ". \n[إبرهيم - 41].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"رَّبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَل لِّي مِن لَّدُنكَ سُلْطَانًا نَّصِيرًا".\n[الإسراء - 80].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا".\n [الكهف - 10].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي يَفْقَهُوا قَوْلِي".\n[طه - 25-28].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description: '"رَّبِّ زِدْنِي عِلْمًا".\n[طه - 114].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ".\n[الأنبياء - 87].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنتَ خَيْرُ الْوَارِثِينَ". \n [الأنبياء - 89].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"رَّبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَعُوذُ بِكَ رَبِّ أَن يَحْضُرُونِ".\n[المؤمنون - 97-98].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنتَ خَيْرُ الرَّاحِمِينَ".\n[المؤمنون - 109].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c8'],
    id: 'z',
    number: 'مره',
    description:
        '"رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ".\n[المؤمنون - 118].',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c9'],
    id: 'z',
    number: 'مره',
    description:
        'دُعَاءُ الذَّهَابِ إلَى المَسْجِدِ\nاللّهُـمَّ اجْعَـلْ في قَلْبـي نورا ، وَفي لِسـاني نورا، وَاجْعَـلْ في سَمْعي نورا، وَاجْعَـلْ في بَصَري نورا، وَاجْعَـلْ مِنْ خَلْفي نورا، وَمِنْ أَمامـي نورا، وَاجْعَـلْ مِنْ فَوْقـي نورا ، وَمِن تَحْتـي نورا .اللّهُـمَّ أَعْطِنـي نورا.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c9'],
    id: 'z',
    number: 'مره',
    description:
        'دُعَاءُ دُخُولِ المَسْجِدِ\nيَبْدَأُ بِرِجْلِهِ اليُمْنَى، وَيَقُولُ:\nأَعوذُ باللهِ العَظيـم وَبِوَجْهِـهِ الكَرِيـم وَسُلْطـانِه القَديـم مِنَ الشّيْـطانِ الرَّجـيم، بِسْمِ اللَّهِ، وَالصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ الله، اللّهُـمَّ افْتَـحْ لي أَبْوابَ رَحْمَتـِك. ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c9'],
    id: 'z',
    number: 'مره',
    description:
        'دُعَاءُ الخُرُوجِ مِنَ المَسْجِدِ\nيَبْدَأُ بِرِجْلِهِ الْيُسْرَى، وَيَقُولُ:\nبِسْـمِ اللَّـهِ وَالصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ إنِّي أَسْأَلُكَ مِنْ فَضْلِكَ، اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيم. ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c10'],
    id: 'z',
    number: 'مره',
    description: 'الذكر قبل الوضوء\nقبل الوضوء: "بِسْمِ ٱللّٰهِ".',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c10'],
    id: 'z',
    number: 'مره',
    description:
        'الذكر بعد الوضوء\n"أشْهَدُ أن لا إله إلا الله وحْدَهُ لا شريكَ لهُ ، وأشْهَدُ أنَّ محمداً عَبدُهُ ورسُولُه".\n"اللَّهُمَّ اجْعَلْني مِنَ التَّوَّابينَ واجْعَلْنِي من المُتَطَهِّرِينَ".\n"سُبْحَانَكَ اللَّهُمَّ وبَحَمْدكَ أشْهدُ أنْ لا إلهَ إلا أنْتَ أَسْتَغْفِرُكَ وأتُوبُ إِلَيْكَ". ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c11'],
    id: 'z',
    number: 'مره',
    description:
        'أذكار الدخول إلى المنزل\nبِسْـمِ اللهِ وَلَجْنـا، وَبِسْـمِ اللهِ خَـرَجْنـا، وَعَلـى رَبِّنـا تَوَكّلْـنا.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c11'],
    id: 'z',
    number: 'مره',
    description:
        'أذكار الخروج من المنزل\nبِسْمِ اللهِ ، تَوَكَّلْـتُ عَلى اللهِ وَلا حَوْلَ وَلا قُـوَّةَ إِلاّ بِالله.\nاللّهُـمَّ إِنِّـي أَعـوذُ بِكَ أَنْ أَضِـلَّ أَوْ أُضَـل ، أَوْ أَزِلَّ أَوْ أُزَل ، أَوْ أَظْلِـمَ أَوْ أَُظْلَـم ، أَوْ أَجْهَلَ أَوْ يُـجْهَلَ عَلَـيّ.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c12'],
    id: 'z',
    number: 'مره',
    description:
        'الذكر عند الخلاء\n(بِسْمِ الله) اللّهُـمَّ إِنِّـي أَعـوذُ بِـكَ مِـنَ الْخُـبْثِ وَالْخَبائِث.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c12'],
    id: 'z',
    number: 'مره',
    description: 'الذكر بعد الخروج من الخلاء\nغُفْـرانَك. ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c13'],
    id: 'z',
    number: 'مره',
    description:
        'الذكر عند الطعام والشراب\nبِسْمِ اللهِ.\nفإنْ نسي في أَوَّلِهِ، فَليَقُلْ:\nبِسْمِ اللَّه أَوَّلَهُ وَآخِرَهُ. ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c13'],
    id: 'z',
    number: 'مره',
    description:
        'الذكر عند شرب اللبن\nاَللَّهُمَّ بَارِكْ لَنَا فِيهِ, وَزِدْنَا مِنْهُ. ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c13'],
    id: 'z',
    number: 'مره',
    description:
        'الذكر عند الفراغ من الطعام والشراب\nالْحَمْدُ للهِ الَّذِي أَطْعَمَنِي هَذَا, وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِّنِّي وَلاَ قُوَّةٍ.\nالْحَمْدُ لِلَّهِ كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ غَيْرَ مَكْفِيٍّ وَلَا مُوَدَّعٍ وَلَا مُسْتَغْنًى عَنْهُ رَبَّنَا. ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c13'],
    id: 'z',
    number: 'مره',
    description:
        'هدى النبى فى الشرب\nكَانَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَشْرَبُ فِي ثَلاَثَةِ أَنْفَاسٍ، إِذَا أَدْنَى الإِنَاءَ إِلَى فَمِهِ سَمَّى اللهَ تَعَالَى, وَإِذَا أَخَّرَهُ حَمِدَ اللهَ تَعَالَى، يَفْعَلُ ذَلِكَ ثَلاَثَ مَرَّاتٍ. ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ أبدله داراً خيراً من داره، وأهلاً خيراً من أهله، وأدخله الجنّة، وأعذه من عذاب القبر ومن عذاب النّار',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description: 'اللَّهُمَّ عامله بما أنت أهله، ولا تعامله بما هو أهله.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ اجزه عن الإحسان إحساناً وعن الإساءة عفواً وغفراناً.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إن كان محسناً فزد من حسناته، وإن كان مسيئاً فتجاوز عن سيّئاته.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description: 'اللَّهُمَّ أدخله الجنّة من غير مناقشة حساب ولا سابقة عذاب.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description: 'اللَّهُمَّ آنسه في وحدته وفي وحشته وفي غربته',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description: 'اللَّهُمَّ أنزله منزلاً مباركاً وأنت خير المنزلين.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ أنزله منازل الصدّيقين والشّهداء والصّالحين، وحسن أولئك رفيقاً.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ اجعل قبره روضةً من رياض الجنّة، ولا تجعله حفرةً من حفر النّار.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ افسح له في قبره مدّ بصره، وافرش قبره من فراش الجنّة.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description: 'اللَّهُمَّ أعذه من عذاب القبر، وجفاف ِالأرض عن جنبيها.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description: 'اللَّهُمَّ املأ قبره بالرّضا والنّور والفسحة والسّرور.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إنّه في ذمّتك وحبل جوارك، فقِهِِ فتنة القبر، وعذاب النّار، وأنت أهل الوفاء والحقّ، فاغفر له وارحمه إنّك أنت الغفور الرّحيم',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إنّه عبدك وابن عبدك خرج من الدّنيا وسعتها ومحبوبها وأحبّائه فيها إلى ظلمة القبر وما هو لاقيه',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إنّه كان يشهد أنّك لا إله إلّا أنت وأنّ محمّداً عبدك ورسولك وأنت أعلم به.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إنّا نتوسّل بك إليك، ونقسم بك عليك أن ترحمه ولا تعذّبه، وأن تثبّته عند السؤال.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إنّه نَزَل بك وأنت خير منزولٍ به، وأصبح فقيراً إلى رحمتك وأنت غنيٌّ عن عذابه.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ آته برحمتك ورضاك، وقهِ فتنة القبر وعذابه، وآته برحمتك الأمن من عذابك حتّى تبعثه إلى جنّتك يا أرحم الرّاحمين.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ انقله من مواطن الدّود وضيق اللحود إلى جنّات الخلود.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ احمه تحت الأرض، واستره يوم العرض، ولا تخزه يوم يبعثون "يوم لا ينفع مالٌ ولا بنون إلّا من أتى الله بقلبٍ سليم".',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ يمّن كتابه، ويسّر حسابه، وثقّل بالحسنات ميزانه، وثبّت على الصّراط أقدامه، وأسكنه في أعلى الجنّات بجوار حبيبك ومصطفاك (صلّى الله عليه وسلّم).',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ أمّنه من فزع يوم القيامة، ومن هول يوم القيامة، واجعل نفسه آمنة مطمئنّة، ولقّنه حجّته.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ اجعله في بطن القبر مطمئنّاً وعند قيام الأشهاد آمن، وبجود رضوانك واثق، وإلى أعلى درجاتك سابق.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ اجعل عن يمينه نوراً حتّى تبعثه آمناً مطمئنّاً في نورٍ من نورك.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ انظر إليه نظرة رضا، فإنّ من تنظر إليه نظرة رضا لا تعذّبه أبداً.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ أسكنه فسيح الجنان، واغفر له يا رحمن، وارحمه يا رحيم، وتجاوز عمّا تعلم يا عليم.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description: 'اللَّهُمَّ اعف عنه فإنّك القائل "ويعفو عن كثير".',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إنّه جاء ببابك، وأناخ بجنابك، فَجد عليه بعفوك وإكرامك وجود إحسانك.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إنّ رحمتك وسعت كلّ شيء فارحمه رحمةً تطمئنّ بها نفسه، وتقرّ بها عينه.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description: 'اللَّهُمَّ احشره مع المتّقين إلى الرّحمن وفداً.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ احشره مع أصحاب اليمين، واجعل تحيّته سلامٌ لك من أصحاب اليمين.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ بشّره بقولك "كلوا واشربوا هنيئاً بما أسلفتم في الأيّام الخالية".',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ اجعله من الّذين سعدوا في الجنّة خالدين فيها ما دامت السموات والأرض.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ لا نزكّيه عليك، ولكنّا نحسبه أنّه أمن وعمل صالحاً، فاجعل له جنّتين ذواتي أفنان بحقّ قولك: "ولمن خاف مقام ربّه جنّتان".',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ شفع فيه نبيّنا ومصطفاك، واحشره تحت لوائه، واسقه من يده الشّريفة شربةً هنيئةً لا يظمأ بعدها أبداً.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ اجعله في جنّة الخلد "الَّتِي وُعِدَ الْمُتَّقُونَ كَانَتْ لَهُمْ جَزَاء وَمَصِيرًا. لَهُمْ فِيهَا مَا يَشَاؤُونَ خَالِدِينَ كَانَ عَلَى رَبِّكَ وَعْدًا مَسْؤُولا".',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إنّه صبر على البلاء فلم يجزع، فامنحه درجة الصّابرين الّذين يوفون أجورهم بغير حساب فإنّك القائل "إنّما يوفي الصّابرون أجرهم بغير حساب"',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إنّه كان مصلّ لك، فثبّته على الصّراط يوم تزل الأقدام.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description: 'اللَّهُمَّ إنّه كان صائماً لك، فأدخله الجنّة من باب الريّان.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إنّه كان لكتابك تالٍ وسامع، فشفّع فيه القرآن، وارحمه من النّيران، واجعله يا رحمن يرتقي في الجنّة إلى آخر آية قرأها أو سمعها، وآخر حرفٍ تلاه.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ ارزقه بكلّ حرفٍ في القرآن حلاوة، وبكلّ كلمة كرامة، وبكلّ اّية سعادة، وبكلّ سورة سلامة، وبكل جْزءٍ جزاء',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ ارحمه فإنّه كان مسلماً، واغفر له فإنّه كان مؤمناً، وأدخله الجنّة فإنّه كان بنبيّك مصدّقاً، وسامحه فإنّه كان لكتابك مرتّلاً.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ اغفر لحيّنا وميّتنا، وشاهدنا وغائبنا، وصغيرنا وكبيرنا، وذَكرنَا وأنثانا.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ من أحييته منّا فأحيه على الإسلام، ومن توفّيته منّا فتوفّه على الإيمان.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description: 'اللَّهُمَّ لا تحرمنا أجره ولا تضللنا بعده.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ ارحمنا إذا أتانا اليقين، وعرق منّا الجبين، وكثر الأنين والحنين.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ ارحمنا إذا يئس منّا الطبيب، وبكى علينا الحبيب، وتخلّى عنّا القريب والغريب، وارتفع النّشيج والنّحيب.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ ارحمنا إذا اشتدّت الكربات، وتوالت الحسرات، وأطبقت الرّوعات، وفاضت العبرات، وتكشّفت العورات، وتعطّلت القوى والقدرات.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ ارحمنا إذا حُمِلنا على الأعناقِ، وبلغتِ التراقِ، وقيل من راق وظنّ أنّه الفراق والتفَّتِ السَّاقُ بالسَّاقِ، إليك يا ربَّنا يومئذٍ المساق.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ ارحمنا إذا ورينا التّراب، وغلقت القبور والأبواب، وانفضّ الأهل والأحباب، فإذا الوحشة والوحدة وهول الحساب.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ ارحمنا إذا فارقنا النّعيم، وانقطع النّسيم، وقيل ما غرّك بربّك الكريم.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ ارحمنا إذا أقمنا للسؤال، وخاننا المقال، ولم ينفع جاهٌ ولامال ولا عيال، وقد حال الحال، وليس إلّا فضل الكبير المتعال.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ ارحمنا إذا نَسي اسمنا، ودَرس رسمنا، وأحاط بنا قسمنا ووسعنا.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ ارحمنا إذا أهملنا فلم يزرنا زائر، ولم يذكرنا ذاكر، وما لنا من قوّة ولا ناصر، فلا أمل إلّا في القاهر القادر الغافر، يا من إذا وعد أوفى، وإذا توعّد عفا، وشفّع يا ربّ فينا حبيبنا المصطفى، واجعلنا ممّن صفا ووفا، وبالله اكتفى، يا أرحم الرّاحمين، يا حيّ يا قيّوم، يا بديع السموات والأرض، يا ذا الجلال والإكرام.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ إنّه عبدك وابن عبدك وابن أمتك مات وهو يشهد لك بالوحدانيّة ولرسولك بالشّهادة فاغفر له إنّك أنت الغفّار.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ لا تحرمنا أجره، ولا تفتنّا بعده، واغفر لنا وله، واجمعنا معه في جنّات النّعيم يا ربّ العالمين.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description: 'اللَّهُمَّ أنزل على أهله الصّبر والسلوان وارضهم بقضائك.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ ثبّتنا على القول الثّابت في الحياة الدّنيا، وفي الآخرة، ويوم يقوم الأشهاد',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c14'],
    id: 'z',
    number: 'مره',
    description:
        'اللَّهُمَّ صلّ وسلّم وبارك على سيّدنا محمّد، وعلى اّله وصحبه وسلّم إلى يوم الدّين.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c15'],
    id: 'z',
    number: 'مره',
    description:
        'الحمدُ للهِ الّذي كَساني هذا (الثّوب) وَرَزَقَنيه مِنْ غَـيـْرِ حَولٍ مِنّي وَلا قـوّة. ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c16'],
    id: 'z',
    number: 'مره',
    description: 'اللهم لك الحمد أنت كسوتنيه، أسألك من خيره .',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c17'],
    id: 'z',
    number: 'مره',
    description:
        'لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش العظيم، لا إله إلا الله رب السماوات، ورب الأرض ورب العرش الكريم',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c17'],
    id: 'z',
    number: 'مره',
    description:
        'اللهم رحمتك أرجو فلا تكلني إلى نفسي طرفة عين وأصلح لي شأني كله ، لا إله إلا أنت',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c17'],
    id: 'z',
    number: 'مره',
    description: 'لا إله إلا أنت سبحانك إني كنت من الظالمين',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c17'],
    id: 'z',
    number: 'مره',
    description: 'الله الله رب لا أشرك به شيئا',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c18'],
    id: 'z',
    number: 'مره',
    description:
        'اللهم إني عبدك ابن عبدك ابن أمتك ناصيتي بيدك ماض في حكمك ، عدل في قضاؤك أسألك بكل اسم هو لك سميت به نفسك أو أنزلته في كتابك ، أو علمته أحداً من خلقك أو استأثرت به في علم الغيب عندك أن تجعل القرآن ربيع قلبي ، ونور صدري وجلاء حزني وذهاب همي.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c18'],
    id: 'z',
    number: 'مره',
    description:
        'اللهم إني أعوذ بك من الهم والحزن والعجز والكسل والبخل والجبن ، وضلع الدين وغلبة الرجال.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c19'],
    id: 'z',
    number: 'مره',
    description: 'اللهم اكفنى بحلالك عن حرامك وأغننى بفضلك عمن سواك',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c20'],
    id: 'z',
    number: 'مره',
    description:
        'اللهم إنى أسألك خيرها، وخير ما فيها، وخير ما أرسلت به، وأعوذ بك من شرها، وشر ما فيها وشر ما أرسلت به.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c21'],
    id: 'z',
    number: 'مره',
    description: 'سبحان الله الذي يسبح الرعد بحمده والملائكة من خيفته ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c22'],
    id: 'z',
    number: 'مره',
    description:
        'السلام عليكم أهل الديار من المؤمنين والمسلمين، وإنا إن شاء الله بكم لاحقون ويرحم الله المستقدمين منا والمستأخرين، أسأل الله لنا ولكم العافية.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c23'],
    id: 'z',
    number: 'مره',
    description: 'اللهم صيباَ نافعاَ ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c24'],
    id: 'z',
    number: 'مره',
    description:
        'اللهم إنا نسألك في سفرنا هذا البر والتقوى، ومن العمل ماترضى ، اللهم هون علينا سفرنا هـذا واطوِ عنا بعده، اللهم أنت الصاحب في السفر، والخليفة في الأهل، اللهم إني أعوذ بك من وعثاء السفر وكآبة المنظر وسوء المنقلب في المال والأهل.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c24'],
    id: 'z',
    number: 'مره',
    description:
        'وإذا رجع قالهن وزاد فيهن ـ" آيبون ،تآئبون، عابدون ، لربنا حامدون',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c25'],
    id: 'z',
    number: 'مره',
    description: 'اللهم لاسهل إلا ماجعلته سهلا وأنت تجعل الحزن إذا شئت سهلا',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c26'],
    id: 'z',
    number: 'مره',
    description:
        'اللهم إني أعوذ بك أن أشرك بك وأنا أعلم ، وأستغفرك لما لا أعلم ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c27'],
    id: 'z',
    number: 'مره',
    description:
        'الحمد لله الذي عافاني مما ابتلا به وفضلني على كثير ممن خلق تفضيلاً',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c28'],
    id: 'z',
    number: 'مره',
    description: 'أعوذ بالله من الشيطان الرجيـم',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c29'],
    id: 'z',
    number: 'مره',
    description: 'بارك الله لك ، وبارك عليك ، وجمع بينكما في خير ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c30'],
    id: 'z',
    number: 'مره',
    description:
        'اللهم إني أسألك خيرها وخير ماجبلتها عليه وأعوذ بك من شرها وشر ماجبلتها عليه ، وإذا اشترى بعيراً فليأخذ بذروة سنامه وليقل مثل ذلك',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c31'],
    id: 'z',
    number: 'مره',
    description: 'بسم الله ـ اللهم جنبنا الشيطان، وجنب الشيطان مارزقتنا ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c32'],
    id: 'z',
    number: 'مره',
    description:
        'إذا عطـس أحـدكم فليقل : الحمـد لله ، وليقل له أخـوه ، أو صاحبه : يرحمـك الله فـإذا قال له : يرحمك الله ، فليقل : يهديكم الله ويصلح بالكم. ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c33'],
    id: 'z',
    number: 'مره',
    description: 'ذهب الضمـأ ، وأبتلت العروق ، وثبت الأجر إن شاء الله',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c34'],
    id: 'z',
    number: 'مره',
    description:
        'إنا لله وإنا إليه راجعون اللهم أجرني في مصيبتي واخلف لي خيرا منها ',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c35'],
    id: 'z',
    number: 'سبع مرات',
    description:
        'لابأس طهور إن شاء الله مامن عبد مسلم يعود مريضاً لم يحضر أجله فيقول سبع مرات :\nأسأل الله العظيم رب العرش العظيم أن يشفيك إلا عوفي.',
    numberInCircule: 7,
  ),
  Zekr(
    categories: ['c36'],
    id: 'z',
    number: 'مره',
    description:
        'قال جابر بن عبدالله رضي الله عنهما : كان رسول الله صلى الله عليه وسلم يعلمنا الاستخارة في الامور كلها كما يعلمنا السورة من القرآن ، يقول : ( إذا هم أحدكم بالأمر فليركع ركعتين من غير الفريضة ثم ليقل : اللهم إني أستخيرك بعلمك ، وأستقدرك بقدرتك وأسألك من فضلك العظيم فإنك تقدر ولا أقدر وتعلم ولاأعلم وأنت علام الغيوب ، اللهم إن كنت تعلم أن هذا الأمر ـ ويسمي حاجته ـ خيرا لي في ديني ومعاشي وعاقبة أمري ـ أو قال عاجله وآجله ـ فأقدره لي ويسره لي ثم بارك لي فيه ، وإن كنت تعلم أن هذا الأمر شر لي في ديني ومعاشي وعاقبة أمري ـ أو قال عاجله وآجله ـ فاصرفه عني واصرفني عنه واقدر لي الخير حيث كان ثم ارضني به)',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c37'],
    id: 'z',
    number: 'مره',
    description:
        'اللهم باعد بيني وبين خطاياي كما باعدت بين المشرق والغرب ، اللهم نقني من خطاياي كما ينقى الثوب الأبيض من الدنس، اللهم اغسلني من خطاياي بالثلج والماء والبرد.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c38'],
    id: 'z',
    number: 'مره',
    description:
        'كما أخبرنا رسول الله صلى الله عليه وسلم ((ما من عبد يذنب ذنباً فيتوضأ فيحسن الطهور،ثم يقوم فيصلي ركعتين ، ثم يستغفر الله لذلك الذنب إلاَّ غُفر له )).',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c39'],
    id: 'z',
    number: 'مره',
    description:
        'اللهم أنت ربي لا إله إلا أنت ، خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت، أبوئ لك بنعمتك على وأبوئ بذنبي ، فاغفر لي فانه لا يغفر الذنوب إلا أنت.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c40'],
    id: 'z',
    number: 'مره',
    description: 'أن أهل القرآن هم أهل الله.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c40'],
    id: 'z',
    number: 'مره',
    description: 'أن ثواب تلاوة القرآن أعظم من أنفس أموال الدنيا.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c40'],
    id: 'z',
    number: 'مره',
    description: 'أن كل حرف فيه بعشر حسنات.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c40'],
    id: 'z',
    number: 'مره',
    description: 'أنه يورث الإنسان الراحة والذكر الحسن في السماء والأرض.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c40'],
    id: 'z',
    number: 'مره',
    description: 'أن كل آية يحفظها المسلم يرفعه الله بها درجة في الجنة.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c40'],
    id: 'z',
    number: 'مره',
    description: 'أن الماهر بالقرآن يقرنه الله تعالى بأفضل الملائكة.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c40'],
    id: 'z',
    number: 'مره',
    description: 'أن أفضل الناس هو من يتعلم القرآن ويعلمه.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c40'],
    id: 'z',
    number: 'مره',
    description: 'أن الله تعالى لا يعذب إنسانًا حفظ القرآن وعمل به.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c40'],
    id: 'z',
    number: 'مره',
    description: 'أنه يأتي شفيعًا لأصحابه الذين كانوا يعملون به في الدنيا.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c40'],
    id: 'z',
    number: 'مره',
    description:
        'أن صاحب القرآن رفعه النبي صلى الله عليه وسلم صلى الله عليه وسلم إلى مراتب العلماء.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c40'],
    id: 'z',
    number: 'مره',
    description:
        'أن صاحب القرآن يكرمه الله عز وجل عليه وعلى والديه يوم القيامة بأنواع عظيمة من التكريم.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c40'],
    id: 'z',
    number: 'مره',
    description:
        'أن القرآن هو من أعظم القربات التي يتقرب بها إلى الله وأحبها إليه.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c40'],
    id: 'z',
    number: 'مره',
    description:
        'أن الخلق كلهم يكتبون في كل ليلة من الغافلين إلا من قرأ القرآن.',
    numberInCircule: 1,
  ),
  Zekr(
    categories: ['c40'],
    id: 'z',
    number: 'مره',
    description:
        'أن البيت الذي يقرأ فيه القرآن تحصل فيه الخيرات والبركات ويحفظ الله تعالى أهل هذا البيت من كل سوء.',
    numberInCircule: 1,
  ),

  //   ZekrType(
  //   categories: [''],
  //   id: 'z',
  //   number: 'مره',
  //   description:
  //       '',
  //   numberInCircule: 1,
  // ),
];
